app/Filament/Widgets/StatsOverview.php

    protected function getStats(): array
    {
        return [
            Stat::make('Total Movies', Movie::count())
                ->description('Total movies in the system')
                ->descriptionIcon('heroicon-m-film')
                ->color('success'),

            Stat::make('Total Users', User::count())
                ->description('Registered users')
                ->descriptionIcon('heroicon-m-users')
                ->color('primary'),

            Stat::make('Total Bookings', Booking::count())
                ->description('Movie bookings')
                ->descriptionIcon('heroicon-m-ticket')
                ->color('warning'),
        ];
---
SELECT count(*) as aggregate FROM "movies" WHERE "movies"."deleted_at" IS NULL
SELECT count(*) as aggregate FROM "users" WHERE "users"."deleted_at" IS NULL
SELECT count(*) as aggregate FROM "bookings" WHERE "bookings"."deleted_at" IS NULL