app/Filament/Pages/BookMovieNow.php

    public function getMoviesProperty()
    {
        $query = Movie::query();

        if ($this->search) {
            $query->where('title', 'like', '%'.$this->search.'%');
        }

        if ($this->genre) {
            $query->where('genre', 'like', '%'.$this->genre.'%');
        }

        return $query->paginate(5);
---
SELECT * FROM "movies" WHERE "movies"."deleted_at" IS NULL ORDER BY "movies"."created_at" DESC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM "movies" WHERE "movies"."deleted_at" IS NULL